# Conductor Material Get Conductor Material Id By Name Method

Source: https://www.revitapidocs.com/2026/1119b7c5-fde3-65db-4685-b12c7eb61775.htm

---

| Conductor Material Get Conductor Material Id By Name Method |
| --- |

Gets the Conductor Material id by given Conductor Material name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetConductorMaterialIdByName(
	Document document,
	string name
)
```

```
Public Shared Function GetConductorMaterialIdByName (
	document As Document,
	name As String
) As ElementId
```

```
public:
static ElementId^ GetConductorMaterialIdByName(
	Document^ document,
	String^ name
)
```

```
static member GetConductorMaterialIdByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
:   The document.

name String
:   The Conductor Material name.

#### Return Value

ElementId
The Conductor Material id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  name is an empty string. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace